---
type: WorksharedOperationProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# WorksharedOperationProgressChangedEventArgs

`Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Location | 2017 Subscription Update | `public string Location { get ; }` |
| Property | Status | 2017 Subscription Update | `public RevitAPIEventStatus Status { get ; }` |